Управление_торговлей.ПБТ/src/Documents/НастройкаЗначенийПоказателей/НастройкаЗначенийПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НастройкаЗначенийПоказателей</name>
  <basedOn>Document.ПротоколАнализа</basedOn>
  <registerRecords>InformationRegister.ШаблоныЗначенийПоказателей</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляПоказателейВТУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТУ</name>
    <type>
      <types>CatalogRef.ТУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсследования</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>наАнглийскомЯзыке</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/НастройкаЗначенийПоказателей/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ГруппаДляПоказателейВТУПриИзмененииНаСервере()
	Документы.НастройкаЗначенийПоказателей.ЗаполнитьНоменклатуру(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДляПоказателейВТУПриИзменении(Элемент)
	ГруппаДляПоказателейВТУПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧ_ПоказателиПоказательПриИзмененииНаСервере(Идент)
	
	Данные = Объект.ТЧ_Показатели.НайтиПоИдентификатору(Идент);
	
	Если ЗначениеЗаполнено(Данные.Показатель) Тогда
		//Данные.ВидИсследования = Данные.Показатель.ВидИсследования;
		Данные.ЕдиницаИзмерения = Данные.Показатель.ЕдиницаИзмерения;
		Данные.Значение = Данные.Показатель.ТипЗначения.ПривестиЗначение(Данные.Значение);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТЧ_ПоказателиПоказательПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧ_Показатели.ТекущаяСтрока;
	ТЧ_ПоказателиПоказательПриИзмененииНаСервере(ТекСтр);
КонецПроцедуры
